VitaliBorys/cspot-waveshare-esp32s3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# CPU
CONFIG_ESP32S3_DEFAULT_CPU_FREQ_240=y

# PSRAM — ESP32-S3R8 has embedded OPI (Octal) PSRAM, not Quad
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
# PSRAM task stacks cause ESP32-S3 inter-core cache-coherency crashes — disallow them.
CONFIG_FREERTOS_TASK_CREATE_ALLOW_EXT_MEM=n
# Pin all pthreads to Core 0 so civetweb/network threads never run on Core 1.
# Core 1 is reserved for cspot bell::Tasks (with internal-RAM stacks).
CONFIG_PTHREAD_DEFAULT_CORE_0=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# Partitions
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# WiFi
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=8
CONFIG_ESP_WIFI_TX_BUFFER_TYPE_STATIC=y

# Stack sizes
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# SPIFFS
CONFIG_SPIFFS_USE_MAGIC=y

# Bluetooth disabled — not used (WiFi Zeroconf only); freeing ~150KB internal RAM
# prevents CSpotTask stack from spilling to PSRAM (ESP32-S3 cache-incoherency crash)
CONFIG_BT_ENABLED=n

# mDNS
CONFIG_MDNS_TASK_STACK_SIZE=4096

# C++ exceptions (required by cspot)
CONFIG_COMPILER_CXX_EXCEPTIONS=y
CONFIG_COMPILER_CXX_EXCEPTIONS_EMG_POOL_SIZE=0

# mbedTLS memory — default allocator falls back to PSRAM when internal RAM is full.
# IDF default (MBEDTLS_INTERNAL_MEM_ALLOC) exhausts internal RAM before TLS setup.
CONFIG_MBEDTLS_DEFAULT_MEM_ALLOC=y
# Asymmetric TLS buffers: large RX (for server cert chain), small TX (for HTTP requests)
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Watchdog: give more time for OGG decode
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
